server/sql/testdata/soapxml/receiveDocuments_v4.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns4="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:ns5="http://producers.dhl.xtee.riik.ee/producer/dhl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Header>
		<ns4:asutus xsi:type="xsd:string">70006317</ns4:asutus>
		<ns4:andmekogu xsi:type="xsd:string">dhl</ns4:andmekogu>
		<ns4:isikukood xsi:type="xsd:string">EE38806190294</ns4:isikukood>
		<ns4:id xsi:type="xsd:string">13a213c483610391131998353706</ns4:id>
		<ns4:nimi xsi:type="xsd:string">dhl.receiveDocuments.v4</ns4:nimi>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns5:receiveDocuments>
			<keha>
				<arv>10</arv>
				<allyksuse_lyhinimetus>RMTP</allyksuse_lyhinimetus>
			    <ametikoha_lyhinimetus>RAAMATUPIDAJA</ametikoha_lyhinimetus>
      			<kaust/>
      			<edastus_id>12345678_1234</edastus_id>
      			<fragment_nr>-1</fragment_nr>
      			<fragmendi_suurus_baitides>0</fragmendi_suurus_baitides>
			</keha>
		</ns5:receiveDocuments>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>